<a href="https://colab.research.google.com/github/sabsabb/Python-Pandas/blob/main/Pandas_08.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Memeriksa kesamaan antar kolom (Series) pada Data Frame**

---

Import Modules

In [1]:
import pandas as pd
import numpy as np

Persiapan Data Frame

In [2]:
data = {'A':[15, 15, 18, np.nan, 12],
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

Mengenal Pandas Series

In [3]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [6]:
#Akan menghasilkan tipe data pandas series
type(df['A'])

pandas.core.series.Series

In [7]:
#Akan menghasilkan tipe data pandas dataframe
type(df)

pandas.core.frame.DataFrame

Memeriksa Kesamaan Dengan Operator ==

In [9]:
df['A'] == df['B']
#Kelemahan operator ini adalah tidak dapat membandingkan nilai NaN dengan NaN, dimana akan dihasilkan nilai False

0     True
1     True
2     True
3    False
4     True
dtype: bool

Memeriksa Kesamaan Dengan Menggunakan Method equals()

In [10]:
df['A'].equals(df['B'])

True

Memeriksa Kesamaan Antar dua Data Frame

In [11]:
df2 = df.copy(deep=True)

df == df2

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

In [12]:
df.equals(df2)

True